{"pageProps":{"frontmatter":{"title":"Hacking - Por onde começar?","date":"Nov 28 2021","excerpt":"O hacking, engloba diversas áreas, o que pode deixar um iniciante completamente perdido. Então, escrevi este artigo, para ajudá-lo a começar sua trajetória.","category":"hacking","cover_image":null},"slug":"hacking-por-onde-comecar","content":"\r\nO hacking, engloba diversas áreas, entre elas, programação, redes, sistemas operacionais, etc. O que pode deixar um iniciante completamente perdido, sem saber por onde começar. Então, decidi escrever este artigo, para ajudá-lo em sua trajetória.\r\n\r\n## Qual caminho devo seguir?\r\n\r\nEu, sinceramente, não sigo nenhum roadmap, estudo o que eu estiver achando mais interesante no momento, o que me mantém mais consistente. Mas seguir um caminho predefinido, vai com certeza facilitar as coisas. Por isso, criei este roadmap para te ajudar em sua trajetória.\r\n\r\nVamos lá!\r\n\r\n1. **Lógica de Programação**\r\n\r\nÉ recomendado começar por lógica de programação, pois pode facilitar muito o seu aprendizado, porém não é uma regra, você pode seguir diretamente para programação e aprender na prática.\r\n\r\n2. **Programação**\r\n\r\nA programação é essencial para entender como os sistemas funcionam por debaixo dos panos, e desenvolver scripts e ferramentas que você usará no dia a dia.\r\n\r\nAs mais recomendadas são:\r\n- [C](https://www.learn-c.org/)\r\n    - Linguagem compilada\r\n    - Gera arquivos executáveis pequenos\r\n    - É rápida\r\n    - Mais díficil\r\n    - Source code maior\r\n    - Algumas coisas só são possíveis em C (ex: criar drivers)\r\n- [Python](https://www.python.org/)\r\n    - Linguagem interpretada\r\n    - Para gerar arquivos executáveis é preciso usar algumas bibliotecas de terceiros, o que gera arquivos executáveis grandes\r\n    - É um pouco mais lenta comparada ao C\r\n    - Mais fácil\r\n    - Source code menor\r\n\r\nMinha primeira linguagem foi Python, e ainda é minha preferida, principalmente pelo número de bibliotecas, documentação clara, e por gerar um código menor.\r\n\r\n3. **Redes**\r\n\r\nÉ importantíssimo entender como funcionam as conexões, endereços IPs, portas e servidores, para você ser capaz de realizar um bom reconhecimento, parte fundamental de um pentest. Você também pode mesclar seus estudos de programação e redes, treinando com sockets, criando seus próprios servidores, port scanners, etc.\r\n\r\n4. **Sistemas Operacionais**\r\n\r\nTambém é essencial aprender como funcionam os sistemas, aprenda como funciona o CMD e o Powershell do Windows, o terminal do Linux, as permissões do Linux, os principais comandos, etc.\r\n\r\n5. **Bancos de Dados**\r\n\r\nOutra coisa de extrema importância, é aprender SQL, linguagem usada pelos principais bancos de dados. Para praticar você pode instalar um servidor qualquer (ex: XAMPP), um cliente SQL, e ir estudando pelo [W3Schools](https://www.w3schools.com/sql/).\r\n\r\n6. **Linguagem Backend**\r\n\r\nÉ interessante também aprender alguma linguagem backend, como por exemplo PHP, pois o mais importante, é que você consiga entender como as vulnerabilidades acontecem no servidor, para não ficar limitado ao uso ferramentas.\r\n\r\n7. **Vulnerabilidades WEB** \r\n\r\nQuando você tiver aprendido todo o resto, já conseguirá começar a se aprofundar em vulnerabilidades WEB, focando sempre em aprender como ela acontece no lado do servidor, sem depender de ferramentas e scans automáticos. E para isso, a [Web Security Academy](https://portswigger.net/web-security) da PortSwigger, tem vários guias e laboratórios para você aprender como funcionam as vulnerabilidades na prática.\r\n\r\n## Onde posso praticar?\r\n\r\nÉ importante frisar, que procurar vulnerabilidades em sites aleátorios, mesmo que seja apenas para treinar, é **CRIME**, pratique apenas em ambientes controlados!\r\n\r\nE quando se fala em praticar técnicas de hacking, os **CTFs (Capture the Flag)** são sem dúvida, os melhores. Eles simulam um servidor completo, com vários níveis de dificuldades e falhas propositais para você treinar suas habilidades, tendo como objetivo invadir o sistema e capturar a bandeira. \r\n\r\n**Os meus preferidos são:**\r\n* [TryHackMe](https://tryhackme.com/) - Gratuito\r\n* [HackTheBox](https://www.hackthebox.com/) - Gratuito\r\n* [UHC Labs](https://uhclabs.com/) - Pago\r\n\r\n## Obrigado!\r\n\r\nObrigado por ler até aqui, espero que tenha gostado. Em caso de dúvidas, estou à disposição em minhas redes sociais!","categories":{"hacking":4,"criptografia":2,"web":0}},"__N_SSG":true}